Config/InformationRegisters/РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасчетНалогаНаИмуществоПоСреднегодовойСтоимости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0101</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0102</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0103</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0104</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0105</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0106</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0107</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0108</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0109</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0110</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0111</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа0112</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаточнаяСтоимостьНа3112</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИсчислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУменьшенияСуммыНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвансовыхПлатежей1Кв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвансовыхПлатежей2Кв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвансовыхПлатежей3Кв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВидаИмущества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоляСтоимостиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоляСтоимостиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокНалогообложенияИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговойЛьготыОсвобождениеОтНалогообложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОснованияЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/РасчетНалогаНаИмуществоПоСреднегодовойСтоимости/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает результат запроса к данным расчета
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ОтчетныйПериод - Дата
//  НалоговыйОрган - СправочникСсылка.РегистрацииВНалоговомОргане
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ДанныеРасчетаДляДекларации(Организация, ОтчетныйПериод, НалоговыйОрган) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("НалоговыйОрган", НалоговыйОрган);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.Организация КАК Организация,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.НалоговыйОрган КАК НалоговыйОрган,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.КодПоОКТМО КАК КодПоОКТМО,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОсновноеСредство КАК ОсновноеСредство,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.КодВидаИмущества КАК КодВидаИмущества,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.НалоговаяСтавка КАК НалоговаяСтавка,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.КодНалоговойЛьготыОсвобождениеОтНалогообложения КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.КодОснованияЛьготы КАК КодОснованияЛьготы,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.СуммаУменьшенияСуммыНалога КАК СуммаУменьшенияСуммыНалога,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0101 КАК ОстаточнаяСтоимостьНа0101,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0102 КАК ОстаточнаяСтоимостьНа0102,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0103 КАК ОстаточнаяСтоимостьНа0103,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0104 КАК ОстаточнаяСтоимостьНа0104,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0105 КАК ОстаточнаяСтоимостьНа0105,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0106 КАК ОстаточнаяСтоимостьНа0106,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0107 КАК ОстаточнаяСтоимостьНа0107,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0108 КАК ОстаточнаяСтоимостьНа0108,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0109 КАК ОстаточнаяСтоимостьНа0109,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0110 КАК ОстаточнаяСтоимостьНа0110,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0111 КАК ОстаточнаяСтоимостьНа0111,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа0112 КАК ОстаточнаяСтоимостьНа0112,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОстаточнаяСтоимостьНа3112 КАК ОстаточнаяСтоимостьНа3112,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.СуммаАвансовыхПлатежей1Кв КАК СуммаАвансовыхПлатежей1Кв,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.СуммаАвансовыхПлатежей2Кв КАК СуммаАвансовыхПлатежей2Кв,
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.СуммаАвансовыхПлатежей3Кв КАК СуммаАвансовыхПлатежей3Кв
		|ПОМЕСТИТЬ ВТОстаточнаяСтоимость
		|ИЗ
		|	РегистрСведений.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости КАК РасчетНалогаНаИмуществоПоСреднегодовойСтоимости
		|ГДЕ
		|	РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.Организация = &Организация
		|	И РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.ОтчетныйПериод = &ОтчетныйПериод
		|	И РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.НалоговыйОрган = &НалоговыйОрган
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОССрезПоследних.Организация КАК Организация,
		|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
		|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия
		|ПОМЕСТИТЬ ВТДатыСписания
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&ОтчетныйПериод,
		|			(Организация, ОсновноеСредство, ИнвНомер, Событие) В
		|				(ВЫБРАТЬ
		|					ВТОстаточнаяСтоимость.Организация,
		|					ВТОстаточнаяСтоимость.ОсновноеСредство,
		|					ВТОстаточнаяСтоимость.ИнвентарныйНомер,
		|					ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
		|				ИЗ
		|					ВТОстаточнаяСтоимость КАК ВТОстаточнаяСтоимость)) КАК СобытияОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОССрезПоследних.Организация КАК Организация,
		|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
		|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия
		|ПОМЕСТИТЬ ВТДатыПринятияКУчету
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&ОтчетныйПериод,
		|			(Организация, ОсновноеСредство, ИнвНомер, Событие) В
		|				(ВЫБРАТЬ
		|					ВТОстаточнаяСтоимость.Организация,
		|					ВТОстаточнаяСтоимость.ОсновноеСредство,
		|					ВТОстаточнаяСтоимость.ИнвентарныйНомер,
		|					ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
		|				ИЗ
		|					ВТОстаточнаяСтоимость КАК ВТОстаточнаяСтоимость)) КАК СобытияОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстаточнаяСтоимость.Организация КАК Организация,
		|	ВТОстаточнаяСтоимость.НалоговыйОрган КАК НалоговыйОрган,
		|	ВТОстаточнаяСтоимость.КодПоОКТМО КАК КодПоОКАТО,
		|	ВТОстаточнаяСтоимость.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТОстаточнаяСтоимость.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТОстаточнаяСтоимость.КодВидаИмущества КАК КодВидаИмущества,
		|	ВЫБОР
		|		КОГДА ВТОстаточнаяСтоимость.КодВидаИмущества = ""01""
		|			ТОГДА ""18210602020021000110""
		|		ИНАЧЕ ""18210602010021000110""
		|	КОНЕЦ КАК КБК,
		|	ВТОстаточнаяСтоимость.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	ВТОстаточнаяСтоимость.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	ВТОстаточнаяСтоимость.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТОстаточнаяСтоимость.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	ВТОстаточнаяСтоимость.КодНалоговойЛьготыОсвобождениеОтНалогообложения КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВТОстаточнаяСтоимость.КодОснованияЛьготы КАК КодОснованияЛьготы,
		|	ВТОстаточнаяСтоимость.СуммаУменьшенияСуммыНалога КАК СуммаУменьшенияСуммыНалога,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0101 КАК ОстаточнаяСтоимостьНа0101,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0102 КАК ОстаточнаяСтоимостьНа0102,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0103 КАК ОстаточнаяСтоимостьНа0103,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0104 КАК ОстаточнаяСтоимостьНа0104,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0105 КАК ОстаточнаяСтоимостьНа0105,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0106 КАК ОстаточнаяСтоимостьНа0106,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0107 КАК ОстаточнаяСтоимостьНа0107,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0108 КАК ОстаточнаяСтоимостьНа0108,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0109 КАК ОстаточнаяСтоимостьНа0109,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0110 КАК ОстаточнаяСтоимостьНа0110,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0111 КАК ОстаточнаяСтоимостьНа0111,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа0112 КАК ОстаточнаяСтоимостьНа0112,
		|	ВТОстаточнаяСтоимость.ОстаточнаяСтоимостьНа3112 КАК ОстаточнаяСтоимостьНа3112,
		|	ВТОстаточнаяСтоимость.СуммаАвансовыхПлатежей1Кв КАК СуммаАвансовыхПлатежей1Кв,
		|	ВТОстаточнаяСтоимость.СуммаАвансовыхПлатежей2Кв КАК СуммаАвансовыхПлатежей2Кв,
		|	ВТОстаточнаяСтоимость.СуммаАвансовыхПлатежей3Кв КАК СуммаАвансовыхПлатежей3Кв,
		|	ЕСТЬNULL(ВТДатыСписания.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСписания,
		|	ЕСТЬNULL(ВТДатыПринятияКУчету.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияКУчету
		|ИЗ
		|	ВТОстаточнаяСтоимость КАК ВТОстаточнаяСтоимость
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыСписания КАК ВТДатыСписания
		|		ПО ВТОстаточнаяСтоимость.Организация = ВТДатыСписания.Организация
		|			И ВТОстаточнаяСтоимость.ОсновноеСредство = ВТДатыСписания.ОсновноеСредство
		|			И ВТОстаточнаяСтоимость.ИнвентарныйНомер = ВТДатыСписания.ИнвентарныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыПринятияКУчету КАК ВТДатыПринятияКУчету
		|		ПО ВТОстаточнаяСтоимость.Организация = ВТДатыПринятияКУчету.Организация
		|			И ВТОстаточнаяСтоимость.ОсновноеСредство = ВТДатыПринятияКУчету.ОсновноеСредство
		|			И ВТОстаточнаяСтоимость.ИнвентарныйНомер = ВТДатыПринятияКУчету.ИнвентарныйНомер";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
